feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/iLLD/TC27D/Tricore/Gtm/Trig/IfxGtm_Trig.c
    switch (sentGroup)
    {
    case IfxGtm_Trig_SentGroup_0:
    case IfxGtm_Trig_SentGroup_1:
    case IfxGtm_Trig_SentGroup_2:
        table = &IfxGtm_Trig_AdcTrig_tableAdc0_1_2;
        break;
    case IfxGtm_Trig_SentGroup_3:
    case IfxGtm_Trig_SentGroup_4:
        table = &IfxGtm_Trig_AdcTrig_tableAdc3_4;
        break;
    case IfxGtm_Trig_SentGroup_5:
    case IfxGtm_Trig_SentGroup_6:
    case IfxGtm_Trig_SentGroup_7:
        table = &IfxGtm_Trig_AdcTrig_tableAdc5_6_7;
        break;
    case IfxGtm_Trig_SentGroup_8:
        table = &IfxGtm_Trig_AdcTrig_tableAdc8;
        break;
    case IfxGtm_Trig_SentGroup_9:
        table = &IfxGtm_Trig_SentTrig_table;
        break;
    default:
        break;
    }

    if (table != NULL_PTR)
    {
        config = table->trigger[sentTrig].source[source].channel[channel].config;
        result = config != 0xFF;

        if ((sentGroup / 9) == 0) // write to VADC registers
        {
            shift = (sentGroup % 8) * 4;
        }
        else            // write to DSADC registers
        {
            shift = (sentGroup % 9) * 4;
        }

        mask  = 0xFU << shift;
        value = config << shift;

        if ((sentGroup / 9) == 0) // write to VADC registers
        {
            if ((sentGroup / 8) == 0)
            {
                __ldmst_c(&(gtm->ADCTRIG0OUT0.U), mask, value);
            }
            else
            {
                __ldmst_c(&(gtm->ADCTRIG0OUT1.U), mask, value);
            }
        }
        else                // write to DSADC registers
        {
            __ldmst_c(&(gtm->INOUTSEL.DSADC.OUTSEL00.U), mask, value);
        }
    }

    IFX_ASSERT(IFX_VERBOSE_LEVEL_ERROR, result);

    return result;
}
